Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.network.aws_security_group.tenant_sg will be created
+ resource "aws_security_group" "tenant_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "tenant_sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = (known after apply)
      + vpc_id                 = "vpc-04281ea8b507eb10a"
    }

  # module.network.aws_security_group_rule.allow_all_in will be created
+ resource "aws_security_group_rule" "allow_all_in" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.network.aws_security_group_rule.allow_all_out will be created
+ resource "aws_security_group_rule" "allow_all_out" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.network.aws_subnet.apps will be created
+ resource "aws_subnet" "apps" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.126.150.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + vpc_id                          = "vpc-04281ea8b507eb10a"
    }

  # module.network.aws_subnet.data will be created
+ resource "aws_subnet" "data" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.126.150.224/28"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + vpc_id                          = "vpc-04281ea8b507eb10a"
    }

  # module.network.aws_subnet.infra will be created
+ resource "aws_subnet" "infra" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.126.150.192/27"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + vpc_id                          = "vpc-04281ea8b507eb10a"
    }

  # module.vpc.aws_vpc.tenant_vpc will be updated in-place
~ resource "aws_vpc" "tenant_vpc" {
        arn                              = "arn:aws:ec2:us-east-1:027056559285:vpc/vpc-04281ea8b507eb10a"
        assign_generated_ipv6_cidr_block = false
        cidr_block                       = "10.126.150.0/24"
        default_network_acl_id           = "acl-06604a66a5ab1fa96"
        default_route_table_id           = "rtb-0312db245b1e6b93d"
        default_security_group_id        = "sg-0da6b5b4de9ed1372"
        dhcp_options_id                  = "dopt-afa69ed4"
        enable_classiclink               = false
        enable_classiclink_dns_support   = false
        enable_dns_hostnames             = false
        enable_dns_support               = true
        id                               = "vpc-04281ea8b507eb10a"
        instance_tenancy                 = "default"
        main_route_table_id              = "rtb-0312db245b1e6b93d"
        owner_id                         = "027056559285"
      ~ tags                             = {
          - "DeployDate"    = "2019-10-25"
          - "Environment"   = "Development"
          - "Name"          = "tenant2"
          - "ResourceGroup" = "tenant2"
        } -> (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.205.62.16/lock?id=peterdyer7%252Fatlantistest%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
